plat-portal-api/app/payments/tests/fake_data/app_MW/webhook_invoice.paid.json

{
  "type": "invoice.paid",
  "data": {
    "object": {
      "id": "in_1IoqV6BhZLR2oJFVVIQNXEHR",
      "tax": null,
      "paid": true,
      "lines": {
        "url": "/v1/invoices/in_1IoqV6BhZLR2oJFVVIQNXEHR/lines",
        "data": [
          {
            "id": "il_1IoqV6BhZLR2oJFVGJuABeKo",
            "plan": {
              "id": "price_1IVBc0BhZLR2oJFVjutXckbq",
              "active": true,
              "amount": 1000,
              "object": "plan",
              "created": 1615796236,
              "product": "prod_J7QStGwMYujgnp",
              "currency": "usd",
              "interval": "month",
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "tiers_mode": null,
              "usage_type": "licensed",
              "amount_decimal": "1000",
              "billing_scheme": "per_unit",
              "interval_count": 1,
              "aggregate_usage": null,
              "transform_usage": null,
              "trial_period_days": null
            },
            "type": "subscription",
            "price": {
              "id": "price_1IVBc0BhZLR2oJFVjutXckbq",
              "type": "recurring",
              "active": true,
              "object": "price",
              "created": 1615796236,
              "product": "prod_J7QStGwMYujgnp",
              "currency": "usd",
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "recurring": {
                "interval": "month",
                "usage_type": "licensed",
                "interval_count": 1,
                "aggregate_usage": null,
                "trial_period_days": null
              },
              "lookup_key": null,
              "tiers_mode": null,
              "unit_amount": 1000,
              "billing_scheme": "per_unit",
              "transform_quantity": null,
              "unit_amount_decimal": "1000"
            },
            "amount": 1000,
            "object": "line_item",
            "period": {
              "end": 1623160044,
              "start": 1620481644
            },
            "currency": "usd",
            "livemode": false,
            "metadata": {},
            "quantity": 1,
            "discounts": [],
            "proration": false,
            "tax_rates": [],
            "description": "1 × CBPO Standard (at $10.00 / month)",
            "tax_amounts": [],
            "discountable": true,
            "subscription": "sub_JRjzP3sflZEPJZ",
            "discount_amounts": [],
            "subscription_item": "si_JRjz9SkzUm0rdo"
          }
        ],
        "object": "list",
        "has_more": false,
        "total_count": 1
      },
      "total": 1000,
      "charge": "ch_1IoqV7BhZLR2oJFVSemoAFug",
      "footer": null,
      "number": "5A91F934-0021",
      "object": "invoice",
      "status": "paid",
      "created": 1620481644,
      "currency": "usd",
      "customer": "cus_JNBsN0sJoCPAic",
      "discount": null,
      "due_date": null,
      "livemode": false,
      "metadata": {},
      "subtotal": 1000,
      "attempted": true,
      "discounts": [],
      "amount_due": 1000,
      "period_end": 1620481644,
      "amount_paid": 1000,
      "description": null,
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1IVAuQBhZLR2oJFV/invst_JRjzn8dZOFeSeOWVE43qJLQnpePeQlw/pdf",
      "account_name": "CBPO QA",
      "auto_advance": false,
      "on_behalf_of": null,
      "period_start": 1620481644,
      "subscription": "sub_JRjzP3sflZEPJZ",
      "attempt_count": 1,
      "custom_fields": null,
      "customer_name": "dang vu",
      "transfer_data": null,
      "billing_reason": "subscription_create",
      "customer_email": "vnhd1@example.com",
      "customer_phone": null,
      "default_source": null,
      "ending_balance": 0,
      "payment_intent": "pi_1IoqV6BhZLR2oJFVdXNQr9Sw",
      "receipt_number": null,
      "account_country": "US",
      "account_tax_ids": null,
      "amount_remaining": 0,
      "customer_address": null,
      "customer_tax_ids": [],
      "payment_settings": {
        "payment_method_types": null,
        "payment_method_options": null
      },
      "starting_balance": 0,
      "collection_method": "charge_automatically",
      "customer_shipping": null,
      "default_tax_rates": [],
      "total_tax_amounts": [],
      "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1IVAuQBhZLR2oJFV/invst_JRjzn8dZOFeSeOWVE43qJLQnpePeQlw",
      "status_transitions": {
        "paid_at": 1620481646,
        "voided_at": null,
        "finalized_at": 1620481644,
        "marked_uncollectible_at": null
      },
      "customer_tax_exempt": "none",
      "next_payment_attempt": null,
      "statement_descriptor": null,
      "webhooks_delivered_at": null,
      "application_fee_amount": null,
      "default_payment_method": null,
      "total_discount_amounts": [],
      "last_finalization_error": null,
      "pre_payment_credit_notes_amount": 0,
      "post_payment_credit_notes_amount": 0
    }
  }
}