plat-portal-api/app/payments/tests/fake_data/app_transit/invoice_incoming.json

{
  "account_country": "US",
  "account_name": "CBPO DEV",
  "account_tax_ids": null,
  "amount_due": 3999,
  "amount_paid": 0,
  "amount_remaining": 3999,
  "application_fee_amount": null,
  "attempt_count": 0,
  "attempted": false,
  "billing_reason": "upcoming",
  "charge": null,
  "collection_method": "charge_automatically",
  "created": 1625818816,
  "currency": "usd",
  "custom_fields": null,
  "customer": "cus_JNBsN0sJoCPAic",
  "customer_address": null,
  "customer_email": "vnhd1@example.com",
  "customer_name": "dang vu",
  "customer_phone": null,
  "customer_shipping": null,
  "customer_tax_exempt": "none",
  "customer_tax_ids": [],
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [],
  "description": null,
  "discount": null,
  "discounts": [],
  "due_date": null,
  "ending_balance": 0,
  "footer": null,
  "last_finalization_error": null,
  "lines": {
    "data": [
      {
        "amount": -1000,
        "currency": "usd",
        "description": "Unused time on CBPO Standard after 09 Jun 2021",
        "discount_amounts": [],
        "discountable": false,
        "discounts": [],
        "id": "il_tmp_1J0MmxBhZLR2oJFV2rJEqEgS",
        "invoice_item": "ii_1J0MmxBhZLR2oJFV2rJEqEgS",
        "livemode": false,
        "metadata": {},
        "object": "line_item",
        "period": {
          "end": 1625818816,
          "start": 1623227367
        },
        "plan": {
          "active": true,
          "aggregate_usage": null,
          "amount": 1000,
          "amount_decimal": "1000",
          "billing_scheme": "per_unit",
          "created": 1615796236,
          "currency": "usd",
          "id": "price_1IVBc0BhZLR2oJFVjutXckbq",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": null,
          "object": "plan",
          "product": "prod_J7QStGwMYujgnp",
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "price": {
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1615796236,
          "currency": "usd",
          "id": "price_1IVBc0BhZLR2oJFVjutXckbq",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "object": "price",
          "product": "prod_J7QStGwMYujgnp",
          "recurring": {
            "aggregate_usage": null,
            "interval": "month",
            "interval_count": 1,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 1000,
          "unit_amount_decimal": "1000"
        },
        "proration": true,
        "quantity": 1,
        "subscription": "sub_JddvD38NtyYQlw",
        "subscription_item": "si_Jddv5jtKmxgdVY",
        "tax_amounts": [],
        "tax_rates": [],
        "type": "invoiceitem"
      },
      {
        "amount": 2499,
        "currency": "usd",
        "description": "Remaining time on CBPO Professional after 09 Jun 2021",
        "discount_amounts": [],
        "discountable": false,
        "discounts": [],
        "id": "il_tmp_1J0MmxBhZLR2oJFVSdXlItqz",
        "invoice_item": "ii_1J0MmxBhZLR2oJFVSdXlItqz",
        "livemode": false,
        "metadata": {},
        "object": "line_item",
        "period": {
          "end": 1625818816,
          "start": 1623227367
        },
        "plan": {
          "active": true,
          "aggregate_usage": null,
          "amount": 2500,
          "amount_decimal": "2500",
          "billing_scheme": "per_unit",
          "created": 1615797883,
          "currency": "usd",
          "id": "price_1IVC2ZBhZLR2oJFVE6uZxG9r",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": null,
          "object": "plan",
          "product": "prod_J7QurQTVBdcLgm",
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "price": {
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1615797883,
          "currency": "usd",
          "id": "price_1IVC2ZBhZLR2oJFVE6uZxG9r",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "object": "price",
          "product": "prod_J7QurQTVBdcLgm",
          "recurring": {
            "aggregate_usage": null,
            "interval": "month",
            "interval_count": 1,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 2500,
          "unit_amount_decimal": "2500"
        },
        "proration": true,
        "quantity": 1,
        "subscription": "sub_JddvD38NtyYQlw",
        "subscription_item": "si_Jddv5jtKmxgdVY",
        "tax_amounts": [],
        "tax_rates": [],
        "type": "invoiceitem"
      },
      {
        "amount": 2500,
        "currency": "usd",
        "description": "1 \u00d7 CBPO Professional (at $25.00 / month)",
        "discount_amounts": [],
        "discountable": true,
        "discounts": [],
        "id": "il_tmp_10f7a5BhZLR2oJFVc7d22689",
        "livemode": false,
        "metadata": {},
        "object": "line_item",
        "period": {
          "end": 1628497216,
          "start": 1625818816
        },
        "plan": {
          "active": true,
          "aggregate_usage": null,
          "amount": 2500,
          "amount_decimal": "2500",
          "billing_scheme": "per_unit",
          "created": 1615797883,
          "currency": "usd",
          "id": "price_1IVC2ZBhZLR2oJFVE6uZxG9r",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": null,
          "object": "plan",
          "product": "prod_J7QurQTVBdcLgm",
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "price": {
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1615797883,
          "currency": "usd",
          "id": "price_1IVC2ZBhZLR2oJFVE6uZxG9r",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "object": "price",
          "product": "prod_J7QurQTVBdcLgm",
          "recurring": {
            "aggregate_usage": null,
            "interval": "month",
            "interval_count": 1,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 2500,
          "unit_amount_decimal": "2500"
        },
        "proration": false,
        "quantity": 1,
        "subscription": "sub_JddvD38NtyYQlw",
        "subscription_item": "si_Jddv5jtKmxgdVY",
        "tax_amounts": [],
        "tax_rates": [],
        "type": "subscription"
      }
    ],
    "has_more": false,
    "object": "list",
    "total_count": 3,
    "url": "/v1/invoices/upcoming/lines?subscription=sub_JddvD38NtyYQlw&subscription_proration_date=1623227367"
  },
  "livemode": false,
  "metadata": {},
  "next_payment_attempt": 1625822416,
  "number": null,
  "object": "invoice",
  "on_behalf_of": null,
  "paid": false,
  "payment_intent": null,
  "payment_settings": {
    "payment_method_options": null,
    "payment_method_types": null
  },
  "period_end": 1625818816,
  "period_start": 1623226816,
  "post_payment_credit_notes_amount": 0,
  "pre_payment_credit_notes_amount": 0,
  "receipt_number": null,
  "starting_balance": 0,
  "statement_descriptor": null,
  "status": "draft",
  "status_transitions": {
    "finalized_at": null,
    "marked_uncollectible_at": null,
    "paid_at": null,
    "voided_at": null
  },
  "subscription": "sub_JddvD38NtyYQlw",
  "subscription_proration_date": 1623227367,
  "subtotal": 3999,
  "tax": null,
  "total": 3999,
  "total_discount_amounts": [],
  "total_tax_amounts": [],
  "transfer_data": null,
  "webhooks_delivered_at": null
}