plat-portal-api/app/payments/tests/fake_data/app_transit/webhook_customer.subscription.updated_trialing.json

{
  "type": "customer.subscription.updated",
  "data": {
    "object": {
      "id": "sub_JRjzP3sflZEPJZ",
      "plan": {
        "id": "price_1IVtKaBhZLR2oJFVWIp0mFIz",
        "active": true,
        "amount": 3500,
        "object": "plan",
        "created": 1615964292,
        "product": "prod_J89dTICrDhl4mk",
        "currency": "usd",
        "interval": "month",
        "livemode": false,
        "metadata": {},
        "nickname": null,
        "tiers_mode": null,
        "usage_type": "licensed",
        "amount_decimal": "3500",
        "billing_scheme": "per_unit",
        "interval_count": 1,
        "aggregate_usage": null,
        "transform_usage": null,
        "trial_period_days": null
      },
      "items": {
        "url": "/v1/subscription_items?subscription=sub_JVlLUGrbIYs6Qr",
        "data": [
          {
            "id": "si_JVlL4LcWR94eVo",
            "plan": {
              "id": "price_1IVtKaBhZLR2oJFVWIp0mFIz",
              "active": true,
              "amount": 3500,
              "object": "plan",
              "created": 1615964292,
              "product": "prod_J89dTICrDhl4mk",
              "currency": "usd",
              "interval": "month",
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "tiers_mode": null,
              "usage_type": "licensed",
              "amount_decimal": "3500",
              "billing_scheme": "per_unit",
              "interval_count": 1,
              "aggregate_usage": null,
              "transform_usage": null,
              "trial_period_days": null
            },
            "price": {
              "id": "price_1IVtKaBhZLR2oJFVWIp0mFIz",
              "type": "recurring",
              "active": true,
              "object": "price",
              "created": 1615964292,
              "product": "prod_J89dTICrDhl4mk",
              "currency": "usd",
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "recurring": {
                "interval": "month",
                "usage_type": "licensed",
                "interval_count": 1,
                "aggregate_usage": null,
                "trial_period_days": null
              },
              "lookup_key": null,
              "tiers_mode": null,
              "unit_amount": 3500,
              "billing_scheme": "per_unit",
              "transform_quantity": null,
              "unit_amount_decimal": "3500"
            },
            "object": "subscription_item",
            "created": 1621409246,
            "metadata": {},
            "quantity": 1,
            "tax_rates": [],
            "subscription": "sub_JVlLUGrbIYs6Qr",
            "billing_thresholds": null
          }
        ],
        "object": "list",
        "has_more": false,
        "total_count": 1
      },
      "object": "subscription",
      "status": "trialing",
      "created": 1621409245,
      "customer": "cus_JVlKfTTbouUsG8",
      "discount": null,
      "ended_at": null,
      "livemode": false,
      "metadata": {},
      "quantity": 1,
      "schedule": null,
      "cancel_at": null,
      "trial_end": 1621582045,
      "start_date": 1621409245,
      "canceled_at": null,
      "trial_start": 1621409245,
      "transfer_data": null,
      "days_until_due": null,
      "default_source": null,
      "latest_invoice": "in_1IsjoPBhZLR2oJFVM537oI4p",
      "pending_update": null,
      "pause_collection": null,
      "collection_method": "charge_automatically",
      "default_tax_rates": [],
      "billing_thresholds": null,
      "current_period_end": 1621582045,
      "billing_cycle_anchor": 1621582045,
      "cancel_at_period_end": false,
      "current_period_start": 1621409245,
      "pending_setup_intent": null,
      "default_payment_method": "pm_1IsjoOBhZLR2oJFV0f33JSVO",
      "application_fee_percent": null,
      "pending_invoice_item_interval": null,
      "next_pending_invoice_item_invoice": null
    }
  }
}